Repository: K3NT4/spelhubben-weather
Catalog: languages/spelhubben-weather-*.po
Languages: nb_no

source: Copied!
nb_no: Kopiert!

source: Copy
nb_no: Kopier

source: Expand
nb_no: Utvid

source: Collapse
nb_no: Slå sammen

source: Rendering…
nb_no: Gjengivelse…

source: Failed
nb_no: Mislyktes

source: Preview failed
nb_no: Forhåndsvisning mislyktes

source: Spelhubben Weather
nb_no: Spelhubben Været

source: Settings
nb_no: Innstillinger

source: Shortcodes
nb_no: Kortkode

source: Default settings
nb_no: Standardinnstillinger

source: Default place
nb_no: Standardsted

source: Cache TTL (minutes)
nb_no: Cache-TTL (minutter)

source: Default fields
nb_no: Standardfelt

source: Default layout
nb_no: Standardoppsett

source: Show map by default
nb_no: Vis kart som standard

source: Map height (px)
nb_no: Karthøyde (px)

source: Icon style
nb_no: Ikonstil

source: Data providers
nb_no: Dataleverandører

source: Yr contact/UA
nb_no: Yr kontakt/UA

source: Units & format
nb_no: Enheter og format

source: Preset
nb_no: Forhåndsinnstilt

source: Overrides (optional)
nb_no: Overstyringer (valgfritt)

source: Date format (PHP)
nb_no: Datoformat (PHP)

source: e.g. Stockholm
nb_no: f.eks. Oslo

source: How long weather data is cached (transients).
nb_no: Hvor lenge værdata lagres i mellomlagring (transienter).

source: Comma-separated: temp,wind,icon
nb_no: Kommaseparert: temp, vind, ikon

# layout label
source: Inline
nb_no: Innebygd

# layout label
source: Compact
nb_no: Kompakt

# layout label
source: Card
nb_no: Kort

# layout label
source: Detailed
nb_no: Detaljert

source: Enable map as default.
nb_no: Aktiver kart som standard.

source: Classic
nb_no: Klassisk

source: Modern Flat
nb_no: Moderne leilighet

source: Modern Gradient
nb_no: Moderne gradient

source: Choose your preferred weather icon theme.
nb_no: Velg ditt foretrukne værikontema.

source: Recommended by MET Norway: include an email or URL in your User-Agent.
nb_no: Anbefalt av MET Norge: inkluder en e-postadresse eller URL i brukeragenten din.

source: Metric (°C, m/s, mm)
nb_no: Metrisk (°C, m/s, mm)

source: Metric (°C, km/h, mm)
nb_no: Metrisk (°C, km/t, mm)

source: Temp unit
nb_no: Temp-enhet

source: Wind unit
nb_no: Vindenhet

source: Precip unit
nb_no: Nedbørsenhet

source: Used for forecast day labels.
nb_no: Brukes til etiketter for prognosedag.

source: Cache cleared.
nb_no: Hurtigbufferen er tømt.

source: Spelhubben Weather – Settings
nb_no: Spelhubben Vær – Innstillinger

source: Tune defaults, providers and formatting. Shortcodes now live on their own page.
nb_no: Juster standardinnstillinger, leverandører og formatering. Kortkoder finnes nå på sin egen side.

source: Clear cache (transients)
nb_no: Tøm hurtigbufferen (transienter)

source: Open Shortcodes
nb_no: Åpne kortkoder

source: General
nb_no: Generelt

source: Attribution
nb_no: Attribusjon

source: License requirements
nb_no: Lisenskrav

source: The attribution is locked to comply with OpenStreetMap/ODbL requirements.
nb_no: Attribusjonen er låst for å overholde OpenStreetMap/ODbL-kravene.

source: Why locked?
nb_no: Hvorfor låst?

source: To ensure proper crediting of data sources per ODbL and respective API policies.
nb_no: For å sikre riktig kreditering av datakilder i henhold til ODbL og respektive API-policyer.

source: Use the Shortcodes page to quickly copy examples and see supported attributes.
nb_no: Bruk siden med kortkoder for å raskt kopiere eksempler og se støttede attributter.

source: Shortcode
nb_no: Kortkode

source: Forecast
nb_no: Prognose

source: Leaflet map
nb_no: Brosjyrekart

source: Loading other Spelhubben plugins…
nb_no: Laster inn andre Spelhubben-pluginer …

source: Could not load plugin showcase.
nb_no: Kunne ikke laste inn programtilleggsvisningen.

source: Basic example
nb_no: Grunnleggende eksempel

source: Compact with map & animation
nb_no: Kompakt med kart og animasjon

source: Inline without map
nb_no: Innebygd uten kart

source: Detailed with daily forecast & km/h
nb_no: Detaljert med daglig værmelding og km/t

source: Only temperature + wind, imperial
nb_no: Kun temperatur + vind, imperial

source: Spelhubben Weather – Shortcodes
nb_no: Spelhubben Vær – Kortkoder

source: Copy & paste ready-made snippets. Click “Copy” to put a shortcode on your clipboard.
nb_no: Kopier og lim inn ferdige utdrag. Klikk på «Kopier» for å legge inn en kortkode på utklippstavlen.

source: Back to Settings
nb_no: Tilbake til innstillinger

source: Search examples… e.g. inline, map, imperial
nb_no: Søkeeksempler… f.eks. innebygd, kart, imperial

source: Copy all (visible)
nb_no: Kopier alle (synlige)

source: Quick start – shortcodes
nb_no: Hurtigstart – kortkoder

source: Preview
nb_no: Forhåndsvisning

source: Click a snippet to send it here. You can edit, copy or expand the box.
nb_no: Klikk på et utdrag for å sende det hit. Du kan redigere, kopiere eller utvide boksen.

source: Clear
nb_no: Fjerne

source: Shortcode preview
nb_no: Forhåndsvisning av kortkode

source: Live preview
nb_no: Direkte forhåndsvisning

source: Shortcode live preview
nb_no: Forhåndsvisning av kortkode i sanntid

source: Attributes – overview
nb_no: Attributter – oversikt

source: Location
nb_no: Lokasjon

source: Display
nb_no: Fremvisning

source: Attribute
nb_no: Attributt

source: Description
nb_no: Beskrivelse

source: Example
nb_no: Eksempel

source: Place name to geocode (used if lat/lon are missing).
nb_no: Stedsnavn som skal geokodes (brukes hvis breddegrad/lengdegrad mangler).

source: Coordinates take precedence over place.
nb_no: Koordinater prioriteres fremfor sted.

source: Fields to display: temp,wind,icon
nb_no: Felt som skal vises: temp, vind, ikon

source: inline | compact | card | detailed
nb_no: innebygd | kompakt | kort | detaljert

source: 1/0 to show/hide map
nb_no: 1/0 for å vise/skjule kart

source: Map height in px (min 120).
nb_no: Karthøyde i piksler (min. 120).

source: openmeteo,smhi,yr,metno_nowcast (comma-separated)
nb_no: openmeteo,smhi,yr,metno_nowcast (kommaseparert)

source: 1/0 – subtle animations
nb_no: 1/0 – subtile animasjoner

source: none | daily
nb_no: ingen | daglig

source: Number of days in the forecast (3–10)
nb_no: Antall dager i værmeldingen (3–10)

source: Preset: metric | metric_kmh | imperial
nb_no: Forhåndsinnstilling: metrisk | metrisk_kmt | britisk

source: Override temperature unit
nb_no: Overstyr temperaturenhet

source: Override wind unit
nb_no: Overstyr vindenheten

source: Override precipitation unit
nb_no: Overstyr nedbørsenhet

source: Forecast date label (PHP date)
nb_no: Prognose-datoetikett (PHP-dato)

source: Compact
nb_no: Kompakt

source: Card
nb_no: Kort

source: Detailed
nb_no: Detaljert

source: Place (name)
nb_no: Sted (navn)

source: Coordinates override place when set.
nb_no: Koordinater overstyrer sted når de er angitt.

source: Layout
nb_no: Oppsett

source: Fields (comma-separated)
nb_no: Felt (kommaseparert)

source: Show map
nb_no: Vis kart

source: Animations
nb_no: Animasjoner

source: Date format (PHP date)
nb_no: Datoformat (PHP-dato)

source: Used for forecast labels (default: D j/n)
nb_no: Brukes for prognoseetiketter (standard: D j/n)

source: None
nb_no: Ingen

source: Daily
nb_no: Daglig

source: Days
nb_no: Dager

source: Spelhubben Weather preview (ServerSideRender unavailable). Save/update to view.
nb_no: Forhåndsvisning av Spelhubben-vær (ServerSideRender utilgjengelig). Lagre/oppdater for visning.

source: Display current weather with an optional forecast.
nb_no: Vis gjeldende vær med en valgfri værmelding.

source: Could not load %s.
nb_no: Kunne ikke laste %s.

source: Title:
nb_no: Tittel:

source: Place (name):
nb_no: Sted (navn):

source: Coordinates (optional):
nb_no: Koordinater (valgfritt):

source: Show:
nb_no: Vise:

source: Choose which parts to display in the widget.
nb_no: Velg hvilke deler som skal vises i widgeten.

source: Layout:
nb_no: Oppsett:

source: Map height (px):
nb_no: Karthøyde (px):

source: Forecast:
nb_no: Prognose:

source: Number of days (1–14):
nb_no: Antall dager (1–14):

source: Extra CSS class:
nb_no: Ekstra CSS-klasse:

source: Spelhubben Weather (legacy)
nb_no: Spelhubben Vær (arv)

source: Wind %1$s %2$s
nb_no: Vind %1$s %2$s

source: Wind: %1$s %2$s
nb_no: Vind: %1$s %2$s

source: Precipitation: %1$s %2$s
nb_no: Nedbør: %1$s %2$s

source: Cloud cover: %s%%
nb_no: Skydekke: %s%%

source: View on OpenStreetMap
nb_no: Vis på OpenStreetMap

source: Provider Comparison
nb_no: Leverandørsammenligning

source: sources
nb_no: kilder

source: Each provider may report different values due to different measuring stations or calculation methods. Use this view to compare accuracy and availability.
nb_no: Hver leverandør kan rapportere forskjellige verdier på grunn av forskjellige målestasjoner eller beregningsmetoder. Bruk denne visningen til å sammenligne nøyaktighet og tilgjengelighet.

source: Could not fetch weather data from the selected providers.
nb_no: Kunne ikke hente værdata fra de valgte leverandørene.

source: Could not find the place.
nb_no: Kunne ikke finne stedet.

source: Could not fetch plugin list right now.
nb_no: Kunne ikke hente listen over pluginer akkurat nå.

source: Retry
nb_no: Prøv på nytt

source: No other plugins found.
nb_no: Ingen andre programtillegg funnet.

source: Other plugins by Spelhubben:
nb_no: Andre programtillegg fra Spelhubben:

source: Details
nb_no: Detaljer

source: Active:
nb_no: Aktiv:

source: Tested:
nb_no: Testet:

source: Unknown
nb_no: Ukjent

source: Mostly clear
nb_no: Stort sett klart

source: Partly cloudy
nb_no: Delvis overskyet

source: Overcast
nb_no: Overskyet

source: Fog
nb_no: Tåke

source: Freezing fog
nb_no: Iskald tåke

source: Light drizzle
nb_no: Lett yr

source: Moderate drizzle
nb_no: Moderat yr

source: Dense drizzle
nb_no: Tett yr

source: Light rain
nb_no: Lett regn

source: Moderate rain
nb_no: Moderat regn

source: Heavy rain
nb_no: Kraftig regn

source: Light freezing rain
nb_no: Lett underkjølt regn

source: Heavy freezing rain
nb_no: Kraftig underkjølt regn

source: Light snowfall
nb_no: Lett snøfall

source: Moderate snowfall
nb_no: Moderat snøfall

source: Heavy snowfall
nb_no: Kraftig snøfall

source: Snow grains
nb_no: Snøkorn

source: Light rain showers
nb_no: Lett regnbyge

source: Moderate rain showers
nb_no: Moderate regnbyger

source: Violent rain showers
nb_no: Voldsomme regnbyger

source: Light snow showers
nb_no: Lette snøbyger

source: Heavy snow showers
nb_no: Kraftige snøbyger

source: Thunderstorm
nb_no: Tordenvær

source: Thunderstorm (slight hail)
nb_no: Tordenvær (lett hagl)

source: Thunderstorm (heavy hail)
nb_no: Tordenvær (kraftig hagl)

source: Clear sky
nb_no: Klar himmel

source: Depositing rime fog
nb_no: Avsetning av rimtåke

source: Drizzle: light
nb_no: Yrregn: lett

source: Drizzle: moderate
nb_no: Yr: moderat

source: Drizzle: dense
nb_no: Yr: tett

source: Rain: light
nb_no: Lett regn

source: Rain: moderate
nb_no: Regn: moderat

source: Rain: heavy
nb_no: Regn: kraftig

source: Freezing rain: light
nb_no: Underkjølt regn: lett

source: Freezing rain: heavy
nb_no: Underkjølt regn: kraftig

source: Snowfall: light
nb_no: Snøfall: lett

source: Snowfall: moderate
nb_no: Snøfall: moderat

source: Snowfall: heavy
nb_no: Snøfall: kraftig

source: Rain showers: slight
nb_no: Regnbyger: lett

source: Rain showers: moderate
nb_no: Regnbyger: moderat

source: Rain showers: violent
nb_no: Regnbyger: voldsomme

source: Snow showers: slight
nb_no: Snøbyger: lette

source: Snow showers: heavy
nb_no: Snøbyger: kraftig

source: Thunderstorm with slight hail
nb_no: Tordenvær med lett hagl

source: Thunderstorm with heavy hail
nb_no: Tordenvær med kraftig hagl

source: Precipitation
nb_no: Nedbør

source: Displays current weather and an optional forecast with a simple consensus across providers (Open-Meteo, SMHI, Yr/MET Norway). Supports shortcode + Gutenberg block + classic widget. Optional Leaflet map, subtle animations, daily forecast, and multiple layouts.
nb_no: Viser gjeldende vær og en valgfri værmelding med en enkel konsensus på tvers av leverandører (Open-Meteo, SMHI, Yr/MET Norge). Støtter shortcode + Gutenberg-blokk + klassisk widget. Valgfritt brosjyrekart, diskré animasjoner, daglig værmelding og flere oppsett.
