Repository: K3NT4/spelhubben-weather
Catalog: spelhubben-weather/languages/spelhubben-weather-*.po
Languages: sv_se

source: Copied!
sv_se: Kopierad!

source: Copy
sv_se: Kopiera

source: Spelhubben Weather
sv_se: Spelhubben Väder

source: Default settings
sv_se: Standardinställningar

source: Default place
sv_se: Standardplats

source: e.g. Stockholm
sv_se: t.ex. Stockholm

source: Cache TTL (minutes)
sv_se: Cache-TTL (minuter)

source: How long weather data is cached (transients).
sv_se: Hur länge väderdata cachas (transienter).

source: Default fields
sv_se: Standardfält

source: Comma-separated: temp,wind,icon
sv_se: Kommaavgränsad: temp, vind, ikon

source: Default layout
sv_se: Standard Layout

# layout label
source: Compact
sv_se: Kompakt

# layout label
source: Card
sv_se: Kort

# layout label
source: Detailed
sv_se: Detaljer

source: Show map by default
sv_se: Visa karta som standard

source: Enable map as default.
sv_se: Aktivera karta som standard.

source: Map height (px)
sv_se: Karthöjd (px)

source: Data providers
sv_se: Dataleverantörer

source: Recommended by MET Norway: include an email or URL in your User-Agent.
sv_se: Rekommenderas av MET Norge: inkludera en e-postadress eller URL i din användaragent.

source: Spelhubben Weather – Settings
sv_se: Spelhubben Väder – Inställningar

source: General
sv_se: Allmänt

source: Attribution
sv_se: Erkännande

source: License requirements
sv_se: Licenskrav

source: The attribution is locked to comply with OpenStreetMap/ODbL requirements.
sv_se: Attributionen är låst för att följa OpenStreetMap/ODbL-kraven.

source: Why locked?
sv_se: Varför låst?

source: To ensure proper crediting of data sources per ODbL and respective API policies.
sv_se: För att säkerställa korrekt kreditering av datakällor enligt ODbL och respektive API-policyer.

source: Quick start – shortcodes
sv_se: Snabbstart – kortkoder

source: Basic example
sv_se: Grundläggande exempel

source: Compact with map & animation
sv_se: Kompakt med karta och animation

source: Inline without map
sv_se: Inline utan karta

source: Detailed with daily forecast & all providers
sv_se: Detaljerad med daglig prognos och alla leverantörer

source: Only temperature + wind, no map
sv_se: Endast temperatur + vind, ingen karta

source: Legacy shortcode examples (kept for compatibility)
sv_se: Exempel på äldre shortcode-koder (behållna för kompatibilitet)

source: Basic example (legacy)
sv_se: Grundläggande exempel (äldre)

source: Compact with map & animation (legacy)
sv_se: Kompakt med karta och animation (äldre version)

source: Inline without map (legacy)
sv_se: Inline utan karta (äldre version)

source: Detailed with daily forecast & all providers (legacy)
sv_se: Detaljerad med daglig prognos och alla leverantörer (äldre)

source: Only temperature + wind, no map (legacy)
sv_se: Endast temperatur + vind, ingen karta (äldre)

source: Attributes – overview
sv_se: Attribut – översikt

source: Attribute
sv_se: Attribut

source: Description
sv_se: Beskrivning

source: Example
sv_se: Exempel

source: Place name to geocode (used if lat/lon are missing).
sv_se: Ortsnamn att geokoda (används om latitud/longitud saknas).

source: Coordinates take precedence over place.
sv_se: Koordinater har företräde framför plats.

source: Fields to display: temp,wind,icon
sv_se: Fält att visa: temp, vind, ikon

source: inline | compact | card | detailed
sv_se: inline | kompakt | kort | detaljerad

source: 1/0 to show/hide map
sv_se: 1/0 för att visa/dölja kartan

source: Map height in px (min 120).
sv_se: Karthöjd i px (minst 120).

source: openmeteo,smhi,yr,metno_nowcast (comma-separated)
sv_se: openmeteo,smhi,yr,metno_nowcast (kommaseparerad)

source: 1/0 – subtle animations
sv_se: 1/0 – subtila animationer

source: none | daily
sv_se: ingen | dagligen

source: Number of days in the forecast (3–10)
sv_se: Antal dagar i prognosen (3–10)

source: Custom CSS class on the wrapper
sv_se: Anpassad CSS-klass på omslaget

source: Shortcode
sv_se: Kortkod

source: Gutenberg block
sv_se: Gutenberg-blocket

source: Leaflet map
sv_se: Broschyrkarta

source: Animation
sv_se: Animering

source: Compact
sv_se: Kompakt

source: Card
sv_se: Kort

source: Detailed
sv_se: Detaljer

source: Location
sv_se: Plats

source: Place (name)
sv_se: Ortnamn:

source: Coordinates override place when set.
sv_se: Koordinater åsidosätter plats när de är inställda.

source: Display
sv_se: Visa

source: Fields (comma-separated)
sv_se: Fält (kommaseparerade)

source: Show map
sv_se: Visa karta

source: Animations
sv_se: Animationer

source: Forecast
sv_se: Prognos

source: Type
sv_se: Typ

source: None
sv_se: Ingen

source: Daily
sv_se: Dagligen

source: Days
sv_se: Dagar

source: Spelhubben Weather preview (ServerSideRender unavailable). Save/update to view.
sv_se: Förhandsvisning av Spelhubbens väder (ServerSideRender är inte tillgänglig). Spara/uppdatera för visning.

source: Display current weather with an optional forecast.
sv_se: Visa aktuellt väder med en valfri prognos.

source: Could not load %s.
sv_se: Kunde inte ladda %s.

source: Title:
sv_se: Titel:

source: Place (name):
sv_se: Ortnamn:

source: Coordinates (optional):
sv_se: Koordinater (valfritt):

source: Show:
sv_se: Visa:

source: Choose which parts to display in the widget.
sv_se: Välj vilka delar som ska visas i widgeten.

source: Map height (px):
sv_se: Karthöjd (px):

source: Forecast:
sv_se: Prognos:

source: Number of days (1–14):
sv_se: Antal dagar (1–14):

source: Extra CSS class:
sv_se: Extra CSS-klass:

source: Spelhubben Weather (legacy)
sv_se: Spelhubben Väder (äldre)

source: Settings
sv_se: Inställningar

source: Wind %s m/s
sv_se: Vind %s m/s

source: Wind: %s m/s
sv_se: Vind: %s m/s

source: Precipitation: %s mm
sv_se: Nederbörd: %s mm

source: Cloud cover: %s%%
sv_se: Molntäcke: %s%%

source: View on OpenStreetMap
sv_se: Visa på OpenStreetMap

source: Could not fetch weather data from the selected providers.
sv_se: Kunde inte hämta väderdata från de valda leverantörerna.

source: Could not find the place.
sv_se: Kunde inte hitta platsen.

source: Precipitation
sv_se: Nederbörd

source: Clear
sv_se: Klart

source: Partly cloudy
sv_se: Delvis molnigt

source: Overcast
sv_se: Mulet

source: Mostly clear
sv_se: Mestadels klart

source: Fog
sv_se: Dimma

source: Freezing fog
sv_se: Frusen dimma

source: Light drizzle
sv_se: Lätt duggregn

source: Moderate drizzle
sv_se: Måttligt duggregn

source: Dense drizzle
sv_se: Tät duggregn

source: Light rain
sv_se: Lätt regn

source: Moderate rain
sv_se: Måttligt regn

source: Heavy rain
sv_se: Mycket regn

source: Light freezing rain
sv_se: Lätt underkylt regn

source: Heavy freezing rain
sv_se: Kraftigt underkylt regn

source: Light snowfall
sv_se: Lätt snöfall

source: Moderate snowfall
sv_se: Måttlig snöfall

source: Heavy snowfall
sv_se: Kraftigt snöfall

source: Snow grains
sv_se: Snökorn

source: Light rain showers
sv_se: Lätta regnskurar

source: Moderate rain showers
sv_se: Måttliga regnskurar

source: Violent rain showers
sv_se: Våldsamma regnskurar

source: Light snow showers
sv_se: Lätta snöbyar

source: Heavy snow showers
sv_se: Kraftiga snöbyar

source: Thunderstorm
sv_se: Åskväder

source: Thunderstorm (slight hail)
sv_se: Åska (lätt hagel)

source: Thunderstorm (heavy hail)
sv_se: Åska (kraftig hagel)

source: Clear sky
sv_se: Klar himmel

source: Depositing rime fog
sv_se: Avsättning av rimdimma

source: Drizzle: light
sv_se: Duggregn: lätt

source: Drizzle: moderate
sv_se: Duggregn: måttligt

source: Drizzle: dense
sv_se: Duggregn: tätt

source: Rain: light
sv_se: Regn: lätt

source: Rain: moderate
sv_se: Regn: måttligt

source: Rain: heavy
sv_se: Regn: kraftigt

source: Freezing rain: light
sv_se: Underkylt regn: lätt

source: Freezing rain: heavy
sv_se: Underkylt regn: kraftigt

source: Snowfall: light
sv_se: Snöfall: lätt

source: Snowfall: moderate
sv_se: Snöfall: måttlig

source: Snowfall: heavy
sv_se: Snöfall: kraftigt

source: Rain showers: slight
sv_se: Regnskurar: lätta

source: Rain showers: moderate
sv_se: Regnskurar: måttliga

source: Rain showers: violent
sv_se: Regnskurar: våldsamma

source: Snow showers: slight
sv_se: Snöbyar: lätta

source: Snow showers: heavy
sv_se: Snöbyar: kraftiga

source: Thunderstorm with slight hail
sv_se: Åska med lätt hagel

source: Thunderstorm with heavy hail
sv_se: Åskväder med kraftig hagel

source: Displays current weather and an optional forecast with a simple consensus across providers (Open-Meteo, SMHI, Yr/MET Norway). Supports shortcode + Gutenberg block + classic widget. Optional Leaflet map, subtle animations, daily forecast, and multiple layouts.
sv_se: Visar aktuellt väder och en valfri prognos med en enkel konsensus mellan leverantörer (Open-Meteo, SMHI, Yr/MET Norge). Stöder shortcode + Gutenberg-block + klassisk widget. Valfri broschyrkarta, diskreta animationer, daglig prognos och flera layouter.
